# parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23] 
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]  


backbone:

  [[-1, 1, Conv, [32, 3, 2]],  
   [-1, 1, Conv, [64, 3, 2]], 
   
   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  
   [-1, 1, MP, []], 


   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  


   [-1, 1, MP, []], 


   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  


   [-1, 1, MP, []],  


   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  
  ]


head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, SP, [5]],
   [-1, 1, SP, [5]],
   [-1, 1, SP, [5]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, RepConv, [256, 3, 1]],
   [[-1, -10], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  


   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [21, 1, Conv, [128, 1, 1]], 
   [[-1, -2], 1, Concat, [1]],


   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  


   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [14, 1, Conv, [64, 1, 1]], 
   [[-1, -2], 1, Concat, [1]],


   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],
   [-1, 1, GhostConv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  


   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 50], 1, Concat, [1]],


   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  


   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 40], 1, Concat, [1]],


   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  
      
   [60, 1, GhostConv, [128, 3, 1]],
   [68, 1, GhostConv, [256, 3, 1]],
   [76, 1, GhostConv, [512, 3, 1]],


   [[77,78,79], 1, IDetect, [nc, anchors]],   
  ]
